openfoam/turek_cylinderA/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel Newtonian;

rho 1000;

nu [0 2 -1 0 0 0 0] 0.001;
