openfoam/turek_cylinderA/system/snappyHexMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object snappyHexMeshDict;
}

castellatedMesh true;
snap true;
addLayers false;

geometry
{
    cylinder.stl
    {
        type triSurfaceMesh;
        name cylinder;
    }

    beam3d.stl
    {
        type triSurfaceMesh;
        name beam;
    }
}

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;

    minRefinementCells 0;
    nCellsBetweenLevels 3;

    features
    (
        {
            file "cylinder.eMesh";
            level 2;
        }

        {
            file "beam3d.eMesh";
            level 2;
        }
    );

    refinementSurfaces
    {
        cylinder
        {
            level (2 2);
        }

        beam
        {
            level (2 2);
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
    }

    locationInMesh (0.50 0.30 0.005);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 5;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
}

addLayersControls
{
}

meshQualityControls
{
    maxNonOrtho 65;

    maxBoundarySkewness 20;
    maxInternalSkewness 4;

    maxConcave 80;

    minFlatness 0.5;

    minVol 1e-13;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;

    errorReduction 0.75;
    nSmoothScale 4;
}

mergeTolerance 1e-6;
